---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.RebarShapeConstraintDiameter
source: html/0c456c2d-5382-3da9-8306-8d5c6608ca1e.htm
---
# RebarShapeConstraintDiameter Properties

The choice of rule for measuring the diameter.